balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ64GS606.PIC
        <edc:SFRDef edc:access="nn--nnnnnnnnnnnn" edc:cname="MODCON" edc:desc="" edc:impl="0xcfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--000000000000" edc:name="MODCON" edc:nzwidth="0x10" edc:por="00--000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="XWM" edc:desc="" edc:mask="0xf" edc:name="XWM" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="YWM" edc:desc="" edc:mask="0xf" edc:name="YWM" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="BWM" edc:desc="" edc:mask="0xf" edc:name="BWM" edc:nzwidth="0x4"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="YMODEN" edc:desc="" edc:mask="0x1" edc:name="YMODEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="XMODEN" edc:desc="" edc:mask="0x1" edc:name="XMODEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="XWM0" edc:desc="" edc:mask="0x1" edc:name="XWM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="XWM1" edc:desc="" edc:mask="0x1" edc:name="XWM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="XWM2" edc:desc="" edc:mask="0x1" edc:name="XWM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="XWM3" edc:desc="" edc:mask="0x1" edc:name="XWM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="YWM0" edc:desc="" edc:mask="0x1" edc:name="YWM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="YWM1" edc:desc="" edc:mask="0x1" edc:name="YWM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="YWM2" edc:desc="" edc:mask="0x1" edc:name="YWM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="YWM3" edc:desc="" edc:mask="0x1" edc:name="YWM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BWM0" edc:desc="" edc:mask="0x1" edc:name="BWM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BWM1" edc:desc="" edc:mask="0x1" edc:name="BWM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BWM2" edc:desc="" edc:mask="0x1" edc:name="BWM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BWM3" edc:desc="" edc:mask="0x1" edc:name="BWM3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnr" edc:cname="XMODSRT" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxx0" edc:name="XMODSRT" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxx0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="XS" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="XS" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnr" edc:cname="XMODEND" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxx1" edc:name="XMODEND" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxx1">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="XE" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="XE" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnr" edc:cname="YMODSRT" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxx0" edc:name="YMODSRT" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxx0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="YS" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="YS" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnr" edc:cname="YMODEND" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxx1" edc:name="YMODEND" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxx1">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="YE" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="YE" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="XBREV" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0xxxxxxxxxxxxxxx" edc:name="XBREV" edc:nzwidth="0x10" edc:por="0xxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="XB" edc:desc="" edc:mask="0x7fff" edc:name="XB" edc:nzwidth="0xf"/>
              <edc:SFRFieldDef edc:cname="BREN" edc:desc="" edc:mask="0x1" edc:name="BREN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="XB0" edc:desc="" edc:mask="0x1" edc:name="XB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="XB1" edc:desc="" edc:mask="0x1" edc:name="XB1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="XB2" edc:desc="" edc:mask="0x1" edc:name="XB2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="XB3" edc:desc="" edc:mask="0x1" edc:name="XB3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="XB4" edc:desc="" edc:mask="0x1" edc:name="XB4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="XB5" edc:desc="" edc:mask="0x1" edc:name="XB5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="XB6" edc:desc="" edc:mask="0x1" edc:name="XB6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="XB7" edc:desc="" edc:mask="0x1" edc:name="XB7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="XB8" edc:desc="" edc:mask="0x1" edc:name="XB8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="XB9" edc:desc="" edc:mask="0x1" edc:name="XB9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="XB10" edc:desc="" edc:mask="0x1" edc:name="XB10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="XB11" edc:desc="" edc:mask="0x1" edc:name="XB11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="XB12" edc:desc="" edc:mask="0x1" edc:name="XB12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="XB13" edc:desc="" edc:mask="0x1" edc:name="XB13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="XB14" edc:desc="" edc:mask="0x1" edc:name="XB14" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnnnnnnnnnn" edc:cname="DISICNT" edc:desc="" edc:impl="0x3fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--xxxxxxxxxxxxxx" edc:name="DISICNT" edc:nzwidth="0x10" edc:por="--xxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DISICNT" edc:desc="" edc:islanghidden="true" edc:mask="0x3fff" edc:name="DISICNT" edc:nzwidth="0xe"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="12"/>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="CNEN1" edc:desc="" edc:impl="0xf8ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="CNEN1" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN0IE" edc:desc="" edc:mask="0x1" edc:name="CN0IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN1IE" edc:desc="" edc:mask="0x1" edc:name="CN1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN2IE" edc:desc="" edc:mask="0x1" edc:name="CN2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN3IE" edc:desc="" edc:mask="0x1" edc:name="CN3IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN4IE" edc:desc="" edc:mask="0x1" edc:name="CN4IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN5IE" edc:desc="" edc:mask="0x1" edc:name="CN5IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN6IE" edc:desc="" edc:mask="0x1" edc:name="CN6IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN7IE" edc:desc="" edc:mask="0x1" edc:name="CN7IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN8IE" edc:desc="" edc:mask="0x1" edc:name="CN8IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN9IE" edc:desc="" edc:mask="0x1" edc:name="CN9IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN10IE" edc:desc="" edc:mask="0x1" edc:name="CN10IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN11IE" edc:desc="" edc:mask="0x1" edc:name="CN11IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN12IE" edc:desc="" edc:mask="0x1" edc:name="CN12IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN13IE" edc:desc="" edc:mask="0x1" edc:name="CN13IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN14IE" edc:desc="" edc:mask="0x1" edc:name="CN14IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN15IE" edc:desc="" edc:mask="0x1" edc:name="CN15IE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------nn---nnn" edc:cname="CNEN2" edc:desc="" edc:impl="0xf8ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00---000" edc:name="CNEN2" edc:nzwidth="0x10" edc:por="--------00---000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN16IE" edc:desc="" edc:mask="0x1" edc:name="CN16IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN17IE" edc:desc="" edc:mask="0x1" edc:name="CN17IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN18IE" edc:desc="" edc:mask="0x1" edc:name="CN18IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN22IE" edc:desc="" edc:mask="0x1" edc:name="CN22IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN23IE" edc:desc="" edc:mask="0x1" edc:name="CN23IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="CNPU1" edc:desc="" edc:impl="0xf8ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="CNPU1" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN0PUE" edc:desc="" edc:mask="0x1" edc:name="CN0PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN1PUE" edc:desc="" edc:mask="0x1" edc:name="CN1PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN2PUE" edc:desc="" edc:mask="0x1" edc:name="CN2PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN3PUE" edc:desc="" edc:mask="0x1" edc:name="CN3PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN4PUE" edc:desc="" edc:mask="0x1" edc:name="CN4PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN5PUE" edc:desc="" edc:mask="0x1" edc:name="CN5PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN6PUE" edc:desc="" edc:mask="0x1" edc:name="CN6PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN7PUE" edc:desc="" edc:mask="0x1" edc:name="CN7PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN8PUE" edc:desc="" edc:mask="0x1" edc:name="CN8PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN9PUE" edc:desc="" edc:mask="0x1" edc:name="CN9PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN10PUE" edc:desc="" edc:mask="0x1" edc:name="CN10PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN11PUE" edc:desc="" edc:mask="0x1" edc:name="CN11PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN12PUE" edc:desc="" edc:mask="0x1" edc:name="CN12PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN13PUE" edc:desc="" edc:mask="0x1" edc:name="CN13PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN14PUE" edc:desc="" edc:mask="0x1" edc:name="CN14PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN15PUE" edc:desc="" edc:mask="0x1" edc:name="CN15PUE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------nn---nnn" edc:cname="CNPU2" edc:desc="" edc:impl="0x69e1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00---000" edc:name="CNPU2" edc:nzwidth="0x10" edc:por="--------00---000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN16PUE" edc:desc="" edc:mask="0x1" edc:name="CN16PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN17PUE" edc:desc="" edc:mask="0x1" edc:name="CN17PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN18PUE" edc:desc="" edc:mask="0x1" edc:name="CN18PUE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN22PUE" edc:desc="" edc:mask="0x1" edc:name="CN22PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN23PUE" edc:desc="" edc:mask="0x1" edc:name="CN23PUE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="20"/>
        <edc:SFRDef edc:access="nrrrrnnnrrnnnnn-" edc:cname="INTCON1" edc:desc="" edc:impl="0xffde" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="INTCON1" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OSCFAIL" edc:desc="" edc:mask="0x1" edc:name="OSCFAIL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="STKERR" edc:desc="" edc:mask="0x1" edc:name="STKERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADDRERR" edc:desc="" edc:mask="0x1" edc:name="ADDRERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MATHERR" edc:desc="" edc:mask="0x1" edc:name="MATHERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMACERR" edc:desc="" edc:mask="0x1" edc:name="DMACERR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DIV0ERR" edc:desc="" edc:mask="0x1" edc:name="DIV0ERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SFTACERR" edc:desc="" edc:mask="0x1" edc:name="SFTACERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="COVTE" edc:desc="" edc:mask="0x1" edc:name="COVTE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OVBTE" edc:desc="" edc:mask="0x1" edc:name="OVBTE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OVATE" edc:desc="" edc:mask="0x1" edc:name="OVATE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="COVBERR" edc:desc="" edc:mask="0x1" edc:name="COVBERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="COVAERR" edc:desc="" edc:mask="0x1" edc:name="COVAERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OVBERR" edc:desc="" edc:mask="0x1" edc:name="OVBERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OVAERR" edc:desc="" edc:mask="0x1" edc:name="OVAERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NSTDIS" edc:desc="" edc:mask="0x1" edc:name="NSTDIS" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nr---------nnnnn" edc:cname="INTCON2" edc:desc="" edc:impl="0xc007" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00---------00000" edc:name="INTCON2" edc:nzwidth="0x10" edc:por="00---------00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT0EP" edc:desc="" edc:mask="0x1" edc:name="INT0EP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1EP" edc:desc="" edc:mask="0x1" edc:name="INT1EP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT2EP" edc:desc="" edc:mask="0x1" edc:name="INT2EP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT3EP" edc:desc="" edc:mask="0x1" edc:name="INT3EP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT4EP" edc:desc="" edc:mask="0x1" edc:name="INT4EP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="9"/>
              <edc:SFRFieldDef edc:cname="DISI" edc:desc="" edc:mask="0x1" edc:name="DISI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ALTIVT" edc:desc="" edc:mask="0x1" edc:name="ALTIVT" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnnnnnnnnnn" edc:cname="IFS0" edc:desc="" edc:impl="0x3fef" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000000000000000" edc:name="IFS0" edc:nzwidth="0x10" edc:por="-000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT0IF" edc:desc="" edc:mask="0x1" edc:name="INT0IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IC1IF" edc:desc="" edc:mask="0x1" edc:name="IC1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC1IF" edc:desc="" edc:mask="0x1" edc:name="OC1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1IF" edc:desc="" edc:mask="0x1" edc:name="T1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA0IF" edc:desc="" edc:mask="0x1" edc:name="DMA0IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC2IF" edc:desc="" edc:mask="0x1" edc:name="IC2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC2IF" edc:desc="" edc:mask="0x1" edc:name="OC2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2IF" edc:desc="" edc:mask="0x1" edc:name="T2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3IF" edc:desc="" edc:mask="0x1" edc:name="T3IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SPI1EIF" edc:desc="" edc:mask="0x1" edc:name="SPI1EIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1IF" edc:desc="" edc:mask="0x1" edc:name="SPI1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1RXIF" edc:desc="" edc:mask="0x1" edc:name="U1RXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1TXIF" edc:desc="" edc:mask="0x1" edc:name="U1TXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADIF" edc:desc="" edc:mask="0x1" edc:name="ADIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1IF" edc:desc="" edc:mask="0x1" edc:name="DMA1IF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
