balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ64GS606.PIC
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="-nnn-nnn--------" edc:cname="IPC23" edc:desc="" edc:impl="0x7777" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-100-100--------" edc:name="IPC23" edc:nzwidth="0x10" edc:por="-100-100--------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="PWM1IP" edc:desc="" edc:mask="0x7" edc:name="PWM1IP" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM2IP" edc:desc="" edc:mask="0x7" edc:name="PWM2IP" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="PWM1IP0" edc:desc="" edc:mask="0x1" edc:name="PWM1IP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM1IP1" edc:desc="" edc:mask="0x1" edc:name="PWM1IP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM1IP2" edc:desc="" edc:mask="0x1" edc:name="PWM1IP2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM2IP0" edc:desc="" edc:mask="0x1" edc:name="PWM2IP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2IP1" edc:desc="" edc:mask="0x1" edc:name="PWM2IP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM2IP2" edc:desc="" edc:mask="0x1" edc:name="PWM2IP2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnn-nnn-nnn-nnn" edc:cname="IPC24" edc:desc="" edc:impl="0x77" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-100-100-100-100" edc:name="IPC24" edc:nzwidth="0x10" edc:por="-100-100-100-100">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PWM3IP" edc:desc="" edc:mask="0x7" edc:name="PWM3IP" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM4IP" edc:desc="" edc:mask="0x7" edc:name="PWM4IP" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM5IP" edc:desc="" edc:mask="0x7" edc:name="PWM5IP" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM6IP" edc:desc="" edc:mask="0x7" edc:name="PWM6IP" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM3IP0" edc:desc="" edc:mask="0x1" edc:name="PWM3IP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM3IP1" edc:desc="" edc:mask="0x1" edc:name="PWM3IP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM3IP2" edc:desc="" edc:mask="0x1" edc:name="PWM3IP2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM4IP0" edc:desc="" edc:mask="0x1" edc:name="PWM4IP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM4IP1" edc:desc="" edc:mask="0x1" edc:name="PWM4IP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM4IP2" edc:desc="" edc:mask="0x1" edc:name="PWM4IP2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM5IP0" edc:desc="" edc:mask="0x1" edc:name="PWM5IP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM5IP1" edc:desc="" edc:mask="0x1" edc:name="PWM5IP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM5IP2" edc:desc="" edc:mask="0x1" edc:name="PWM5IP2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM6IP0" edc:desc="" edc:mask="0x1" edc:name="PWM6IP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM6IP1" edc:desc="" edc:mask="0x1" edc:name="PWM6IP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM6IP2" edc:desc="" edc:mask="0x1" edc:name="PWM6IP2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnn------------" edc:cname="IPC25" edc:desc="" edc:impl="0x7777" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-100------------" edc:name="IPC25" edc:nzwidth="0x10" edc:por="-100------------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="AC2IP" edc:desc="" edc:mask="0x7" edc:name="AC2IP" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="12"/>
              <edc:SFRFieldDef edc:cname="AC2IP0" edc:desc="" edc:mask="0x1" edc:name="AC2IP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AC2IP1" edc:desc="" edc:mask="0x1" edc:name="AC2IP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AC2IP2" edc:desc="" edc:mask="0x1" edc:name="AC2IP2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---------nnn-nnn" edc:cname="IPC26" edc:desc="" edc:impl="0x77" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------100-100" edc:name="IPC26" edc:nzwidth="0x10" edc:por="---------100-100">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AC3IP" edc:desc="" edc:mask="0x7" edc:name="AC3IP" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="AC4IP" edc:desc="" edc:mask="0x7" edc:name="AC4IP" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="AC3IP0" edc:desc="" edc:mask="0x1" edc:name="AC3IP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AC3IP1" edc:desc="" edc:mask="0x1" edc:name="AC3IP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AC3IP2" edc:desc="" edc:mask="0x1" edc:name="AC3IP2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="AC4IP0" edc:desc="" edc:mask="0x1" edc:name="AC4IP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AC4IP1" edc:desc="" edc:mask="0x1" edc:name="AC4IP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AC4IP2" edc:desc="" edc:mask="0x1" edc:name="AC4IP2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnn-nnn--------" edc:cname="IPC27" edc:desc="" edc:impl="0x7777" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-100-100--------" edc:name="IPC27" edc:nzwidth="0x10" edc:por="-100-100--------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="ADCP0IP" edc:desc="" edc:mask="0x7" edc:name="ADCP0IP" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADCP1IP" edc:desc="" edc:mask="0x7" edc:name="ADCP1IP" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="ADCP0IP0" edc:desc="" edc:mask="0x1" edc:name="ADCP0IP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCP0IP1" edc:desc="" edc:mask="0x1" edc:name="ADCP0IP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCP0IP2" edc:desc="" edc:mask="0x1" edc:name="ADCP0IP2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADCP1IP0" edc:desc="" edc:mask="0x1" edc:name="ADCP1IP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCP1IP1" edc:desc="" edc:mask="0x1" edc:name="ADCP1IP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCP1IP2" edc:desc="" edc:mask="0x1" edc:name="ADCP1IP2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnn-nnn-nnn-nnn" edc:cname="IPC28" edc:desc="" edc:impl="0x7777" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-100-100-100-100" edc:name="IPC28" edc:nzwidth="0x10" edc:por="-100-100-100-100">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCP2IP" edc:desc="" edc:mask="0x7" edc:name="ADCP2IP" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADCP3IP" edc:desc="" edc:mask="0x7" edc:name="ADCP3IP" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADCP4IP" edc:desc="" edc:mask="0x7" edc:name="ADCP4IP" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADCP5IP" edc:desc="" edc:mask="0x7" edc:name="ADCP5IP" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADCP2IP0" edc:desc="" edc:mask="0x1" edc:name="ADCP2IP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCP2IP1" edc:desc="" edc:mask="0x1" edc:name="ADCP2IP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCP2IP2" edc:desc="" edc:mask="0x1" edc:name="ADCP2IP2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADCP3IP0" edc:desc="" edc:mask="0x1" edc:name="ADCP3IP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCP3IP1" edc:desc="" edc:mask="0x1" edc:name="ADCP3IP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCP3IP2" edc:desc="" edc:mask="0x1" edc:name="ADCP3IP2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADCP4IP0" edc:desc="" edc:mask="0x1" edc:name="ADCP4IP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCP4IP1" edc:desc="" edc:mask="0x1" edc:name="ADCP4IP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCP4IP2" edc:desc="" edc:mask="0x1" edc:name="ADCP4IP2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADCP5IP0" edc:desc="" edc:mask="0x1" edc:name="ADCP5IP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCP5IP1" edc:desc="" edc:mask="0x1" edc:name="ADCP5IP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCP5IP2" edc:desc="" edc:mask="0x1" edc:name="ADCP5IP2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---------nnn-nnn" edc:cname="IPC29" edc:desc="" edc:impl="0x70" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------xxx-100" edc:name="IPC29" edc:nzwidth="16" edc:por="---------xxx-100">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCP6IP" edc:desc="" edc:mask="0x7" edc:name="ADCP6IP" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADCP7IP" edc:desc="" edc:mask="0x7" edc:name="ADCP7IP" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADCP6IP0" edc:desc="" edc:mask="0x1" edc:name="ADCP6IP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCP6IP1" edc:desc="" edc:mask="0x1" edc:name="ADCP6IP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCP6IP2" edc:desc="" edc:mask="0x1" edc:name="ADCP6IP2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADCP7IP0" edc:desc="" edc:mask="0x1" edc:name="ADCP7IP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCP7IP1" edc:desc="" edc:mask="0x1" edc:name="ADCP7IP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCP7IP2" edc:desc="" edc:mask="0x1" edc:name="ADCP7IP2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----rrrr-rrrrrrr" edc:cname="INTTREG" edc:desc="" edc:impl="0xcf3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000-0000000" edc:name="INTTREG" edc:nzwidth="0x10" edc:por="----0000-0000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="VECNUM" edc:desc="" edc:mask="0x7f" edc:name="VECNUM" edc:nzwidth="7"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ILR" edc:desc="" edc:mask="0xf" edc:name="ILR" edc:nzwidth="0x4"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="VECNUM0" edc:desc="" edc:mask="0x1" edc:name="VECNUM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VECNUM1" edc:desc="" edc:mask="0x1" edc:name="VECNUM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VECNUM2" edc:desc="" edc:mask="0x1" edc:name="VECNUM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VECNUM3" edc:desc="" edc:mask="0x1" edc:name="VECNUM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VECNUM4" edc:desc="" edc:mask="0x1" edc:name="VECNUM4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VECNUM5" edc:desc="" edc:mask="0x1" edc:name="VECNUM5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VECNUM6" edc:desc="" edc:mask="0x1" edc:name="VECNUM6" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ILR0" edc:desc="" edc:mask="0x1" edc:name="ILR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ILR1" edc:desc="" edc:mask="0x1" edc:name="ILR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ILR2" edc:desc="" edc:mask="0x1" edc:name="ILR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ILR3" edc:desc="" edc:mask="0x1" edc:name="ILR3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="30"/>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="TMR1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="TMR1" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR1" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="TMR1" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="PR1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1111111111111111" edc:name="PR1" edc:nzwidth="0x10" edc:por="1111111111111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR1" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="PR1" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
