balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ64GS606.PIC
        <edc:SFRDef edc:access="--------nnnnnnnn" edc:cname="PORTE" edc:desc="" edc:impl="0x3ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------xxxxxxxx" edc:name="PORTE" edc:nzwidth="0x10" edc:por="--------xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RE0" edc:desc="" edc:mask="0x1" edc:name="RE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE1" edc:desc="" edc:mask="0x1" edc:name="RE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE2" edc:desc="" edc:mask="0x1" edc:name="RE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE3" edc:desc="" edc:mask="0x1" edc:name="RE3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE4" edc:desc="" edc:mask="0x1" edc:name="RE4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE5" edc:desc="" edc:mask="0x1" edc:name="RE5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE6" edc:desc="" edc:mask="0x1" edc:name="RE6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE7" edc:desc="" edc:mask="0x1" edc:name="RE7" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="RE" edc:desc="" edc:mask="0xffff" edc:name="RE" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------nnnnnnnn" edc:cname="LATE" edc:desc="" edc:impl="0x3ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000" edc:name="LATE" edc:nzwidth="0x10" edc:por="--------00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATE0" edc:desc="" edc:mask="0x1" edc:name="LATE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATE1" edc:desc="" edc:mask="0x1" edc:name="LATE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATE2" edc:desc="" edc:mask="0x1" edc:name="LATE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATE3" edc:desc="" edc:mask="0x1" edc:name="LATE3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATE4" edc:desc="" edc:mask="0x1" edc:name="LATE4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATE5" edc:desc="" edc:mask="0x1" edc:name="LATE5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATE6" edc:desc="" edc:mask="0x1" edc:name="LATE6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATE7" edc:desc="" edc:mask="0x1" edc:name="LATE7" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="LATE" edc:desc="" edc:mask="0xffff" edc:name="LATE" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------nnnnnnnn" edc:cname="ODCE" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000" edc:name="ODCE" edc:nzwidth="16" edc:por="--------00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODCE0" edc:desc="" edc:mask="0x1" edc:name="ODCE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODCE1" edc:desc="" edc:mask="0x1" edc:name="ODCE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODCE2" edc:desc="" edc:mask="0x1" edc:name="ODCE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODCE3" edc:desc="" edc:mask="0x1" edc:name="ODCE3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODCE4" edc:desc="" edc:mask="0x1" edc:name="ODCE4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODCE5" edc:desc="" edc:mask="0x1" edc:name="ODCE5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODCE6" edc:desc="" edc:mask="0x1" edc:name="ODCE6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODCE7" edc:desc="" edc:mask="0x1" edc:name="ODCE7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---------nnnnnnn" edc:cname="TRISF" edc:desc="" edc:impl="0x31ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------1111111" edc:name="TRISF" edc:nzwidth="0x10" edc:por="---------1111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISF0" edc:desc="" edc:mask="0x1" edc:name="TRISF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISF1" edc:desc="" edc:mask="0x1" edc:name="TRISF1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISF2" edc:desc="" edc:mask="0x1" edc:name="TRISF2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISF3" edc:desc="" edc:mask="0x1" edc:name="TRISF3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISF4" edc:desc="" edc:mask="0x1" edc:name="TRISF4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISF5" edc:desc="" edc:mask="0x1" edc:name="TRISF5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISF6" edc:desc="" edc:mask="0x1" edc:name="TRISF6" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="TRISF" edc:desc="" edc:mask="0xffff" edc:name="TRISF" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
