balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ64GS606.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnn---" edc:cname="PWMCAP4" edc:desc="" edc:impl="0xfff8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000---" edc:name="PWMCAP4" edc:nzwidth="0x10" edc:por="0000000000000---">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="PWMCAP4" edc:desc="" edc:islanghidden="true" edc:mask="0x1fff" edc:name="PWMCAP4" edc:nzwidth="0xd"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnn----nnnnnn" edc:cname="LEBCON4" edc:desc="" edc:impl="0xffc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000----000000" edc:name="LEBCON4" edc:nzwidth="0x10" edc:por="000000----000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BPLL" edc:desc="" edc:mask="0x1" edc:name="BPLL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BPLH" edc:desc="" edc:mask="0x1" edc:name="BPLH" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BPHL" edc:desc="" edc:mask="0x1" edc:name="BPHL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BPHH" edc:desc="" edc:mask="0x1" edc:name="BPHH" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BCL" edc:desc="" edc:mask="0x1" edc:name="BCL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BCH" edc:desc="" edc:mask="0x1" edc:name="BCH" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="CLLEBEN" edc:desc="" edc:mask="0x1" edc:name="CLLEBEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLTLEBEN" edc:desc="" edc:mask="0x1" edc:name="FLTLEBEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PLF" edc:desc="" edc:mask="0x1" edc:name="PLF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PLR" edc:desc="" edc:mask="0x1" edc:name="PLR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PHF" edc:desc="" edc:mask="0x1" edc:name="PHF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PHR" edc:desc="" edc:mask="0x1" edc:name="PHR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnnnnnnn---" edc:cname="LEBDLY4" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000---" edc:name="LEBDLY4" edc:nzwidth="16" edc:por="-----00000000---">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="LEB" edc:desc="" edc:mask="0xff" edc:name="LEB" edc:nzwidth="9"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="LEB0" edc:desc="" edc:mask="0x1" edc:name="LEB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB1" edc:desc="" edc:mask="0x1" edc:name="LEB1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB2" edc:desc="" edc:mask="0x1" edc:name="LEB2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB3" edc:desc="" edc:mask="0x1" edc:name="LEB3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB4" edc:desc="" edc:mask="0x1" edc:name="LEB4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB5" edc:desc="" edc:mask="0x1" edc:name="LEB5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB6" edc:desc="" edc:mask="0x1" edc:name="LEB6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB7" edc:desc="" edc:mask="0x1" edc:name="LEB7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB8" edc:desc="" edc:mask="0x1" edc:name="LEB8" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn--nnnn--nnnnnn" edc:cname="AUXCON4" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--0000--000000" edc:name="AUXCON4" edc:nzwidth="16" edc:por="00--0000--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CHOPLEN" edc:desc="" edc:mask="0x1" edc:name="CHOPLEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHOPHEN" edc:desc="" edc:mask="0x1" edc:name="CHOPHEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHOPSEL" edc:desc="" edc:mask="0xf" edc:name="CHOPSEL" edc:nzwidth="4"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="BLANKSEL" edc:desc="" edc:mask="0xf" edc:name="BLANKSEL" edc:nzwidth="4"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="HRDDIS" edc:desc="" edc:mask="0x1" edc:name="HRDDIS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HRPDIS" edc:desc="" edc:mask="0x1" edc:name="HRPDIS" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CHOPSEL0" edc:desc="" edc:mask="0x1" edc:name="CHOPSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHOPSEL1" edc:desc="" edc:mask="0x1" edc:name="CHOPSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHOPSEL2" edc:desc="" edc:mask="0x1" edc:name="CHOPSEL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHOPSEL3" edc:desc="" edc:mask="0x1" edc:name="CHOPSEL3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="BLANKSEL0" edc:desc="" edc:mask="0x1" edc:name="BLANKSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLANKSEL1" edc:desc="" edc:mask="0x1" edc:name="BLANKSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLANKSEL2" edc:desc="" edc:mask="0x1" edc:name="BLANKSEL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLANKSEL3" edc:desc="" edc:mask="0x1" edc:name="BLANKSEL3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
